include/KBWSSoapBinding.runMafft.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://soap.g-language.org/KBWS">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:runMafft>
   <in0></in0>
   <params>
    <strategy></strategy>
    <outorder></outorder>
    <op>0.0</op>
    <ep>0.0</ep>
    <scorematrix></scorematrix>
    <homologs>false</homologs>
    <showhomologs>false</showhomologs>
    <numhomologs>0</numhomologs>
    <threshold>0.0</threshold>
    <referenceseq></referenceseq>
    <harrplot></harrplot>
   </params>
  </ns1:runMafft>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
